---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SlantedColumnFailures.SlantedColumnCannotCutEnd
source: html/1ef54807-ac59-4135-9aad-9b3cf6b5bb86.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SlantedColumnFailures.SlantedColumnCannotCutEnd Property

Unable to trim slanted column end geometry to desired condition.

## Syntax (C#)
```csharp
public static FailureDefinitionId SlantedColumnCannotCutEnd { get; }
```